guangli2015/google_fast_pair_location_tag_nRF5SDK_17_1_0/ble_gfp.c
static int fp_crypto_account_key_filter(uint8_t *out, size_t n, uint16_t salt)
{
  size_t s = fp_crypto_account_key_filter_size(n);
  uint8_t v[FP_ACCOUNT_KEY_LEN + sizeof(salt)];
  account_key_t accountkey_array[5]={0};
  uint8_t h[FP_CRYPTO_SHA256_HASH_LEN];
  uint32_t x;
  uint32_t m;
  ret_code_t            err_code;

  err_code = nrf_queue_read(&account_key_queue,accountkey_array,n);
  if(NRF_SUCCESS != err_code)
  {
     NRF_LOG_ERROR("nrf_queue_read err %x\n",err_code);
  }
   for (size_t i=0;i<n;i++)
      {
         err_code = nrf_queue_push(&account_key_queue,(accountkey_array+i));
         if(NRF_SUCCESS != err_code)
          {
            NRF_LOG_ERROR("nrf_queue_push err %x\n",err_code);
          }
      }

  memset(out, 0, s);
  for (size_t i = 0; i < n; i++) 
  {
    size_t pos = 0;

    memcpy(v, accountkey_array[i].account_key, FP_ACCOUNT_KEY_LEN);
    pos += FP_ACCOUNT_KEY_LEN;

    sys_put_be16(salt, &v[pos]);
      NRF_LOG_INFO(" v[pos] %x v[pos+1] %x",v[pos],v[pos+1]); 
    pos += sizeof(salt);

    nrf_crypto_hash_context_t   hash_context;
    size_t digest_len = NRF_CRYPTO_HASH_SIZE_SHA256;
    // Initialize the hash context
    err_code = nrf_crypto_hash_init(&hash_context, &g_nrf_crypto_hash_sha256_info);
    if(NRF_SUCCESS != err_code)
    {
      NRF_LOG_ERROR("nrf_crypto_hash_init err %x\n",err_code);
    }
    // Run the update function (this can be run multiples of time if the data is accessible
    // in smaller chunks, e.g. when received on-air.
    err_code = nrf_crypto_hash_update(&hash_context, v, pos);
    if(NRF_SUCCESS != err_code)
    {
      NRF_LOG_ERROR("nrf_crypto_hash_update err %x\n",err_code);
    }

    // Run the finalize when all data has been fed to the update function.
    // this gives you the result
    err_code = nrf_crypto_hash_finalize(&hash_context, h, &digest_len);
    if(NRF_SUCCESS != err_code)
    {
      NRF_LOG_ERROR("nrf_crypto_hash_finalize err %x\n",err_code);
    }

    for (size_t j = 0; j < FP_CRYPTO_SHA256_HASH_LEN / sizeof(x); j++) 
    {
      x = sys_get_be32(&h[j * sizeof(x)]);
      m = x % (s * 8);
      WRITE_BIT(out[m / 8], m % 8, 1);
    }
  }
  return 0;
}

int fp_adv_data_fill_non_discoverable(uint8_t * service_data_nondis , size_t  * plen)
{
  //uint8_t service_data_nondis[26]={0};
  service_data_nondis[0]=0x00;//version_and_flags
  size_t account_key_cnt = nrf_queue_utilization_get(&account_key_queue);
  size_t ak_filter_size = fp_crypto_account_key_filter_size(account_key_cnt);
  ret_code_t            err_code;
  if (account_key_cnt == 0) 
  {
    service_data_nondis[1]=0x00;//empty_account_key_list
    *plen=2;
    NRF_LOG_INFO("no accout key **\n");
  } 
  else 
  {
		
    
    uint8_t m_random_vector[2];
    uint16_t salt;


    err_code = nrf_crypto_rng_vector_generate(m_random_vector, 2);
    if(NRF_SUCCESS != err_code)
    {
        NRF_LOG_ERROR("nrf_crypto_rng_vector_generate err %x\n",err_code);
    }

    //test
    //m_random_vector[0]=0x0c;
    //m_random_vector[1]=0x6b;
    salt = (m_random_vector[0] << 8) | m_random_vector[1];
NRF_LOG_INFO("salt ** %x\n",salt);
    service_data_nondis[1] = ((ak_filter_size) << 4) | (FP_FIELD_TYPE_SHOW_PAIRING_UI_INDICATION);
		
    err_code = fp_crypto_account_key_filter((service_data_nondis+2),
						   account_key_cnt, salt);
    if(NRF_SUCCESS != err_code)
    {
        NRF_LOG_ERROR("fp_crypto_account_key_filter err %x\n",err_code);
    }
    service_data_nondis[2+ak_filter_size] = (sizeof(salt) << 4) | (FP_FIELD_TYPE_SALT);
    sys_put_be16(salt, &service_data_nondis[2+ak_filter_size+1]);
    *plen=2+ak_filter_size+2+1;

  }
   print_hex(" service_data_nondis: ", service_data_nondis, *plen);

  return 0;
}


static void auth_data_encode(uint8_t *auth_data_buf,
			     const struct fp_fmdn_auth_data *auth_data,size_t * plen)
{
	__ASSERT(auth_data->data_len >= FP_FMDN_AUTH_SEG_LEN,
		"Authentication: incorrect Data Length parameter");

	/* Prepare Authentication data input for HMAC-SHA256 operation:
	 * (Protocol Major Version || random_nonce || Data ID || Data length ||
	 * Additional data).
	 */
	
        *(auth_data_buf+0) = BT_FAST_PAIR_FMDN_VERSION_MAJOR;
	memcpy(auth_data_buf+1,auth_data->Prandom_nonce,BT_FAST_PAIR_FMDN_RANDOM_NONCE_LEN);
        *(auth_data_buf+1+BT_FAST_PAIR_FMDN_RANDOM_NONCE_LEN) = auth_data->data_id;
        *(auth_data_buf+1+BT_FAST_PAIR_FMDN_RANDOM_NONCE_LEN+1) = auth_data->data_len;
        

	if (auth_data->add_data) {
		memcpy((auth_data_buf+1+BT_FAST_PAIR_FMDN_RANDOM_NONCE_LEN+1+1),
				       auth_data->add_data,
				       (auth_data->data_len - FP_FMDN_AUTH_SEG_LEN));
                *plen = 1+BT_FAST_PAIR_FMDN_RANDOM_NONCE_LEN+1+1+(auth_data->data_len - FP_FMDN_AUTH_SEG_LEN);
                return;
	}
        *plen=1+BT_FAST_PAIR_FMDN_RANDOM_NONCE_LEN+1+1;

}

static bool account_key_find_iterator(uint8_t *auth_data_buf, size_t auth_data_buf_len,uint8_t * Pauth_seg)
{

  ret_code_t            err_code;
  account_key_t accountkey_array[5]={0};
  uint8_t local_auth_seg[NRF_CRYPTO_HASH_SIZE_SHA256] = {0};
  size_t local_auth_seg_len = sizeof(local_auth_seg);
  size_t account_key_cnt = nrf_queue_utilization_get(&account_key_queue);
  err_code = nrf_queue_read(&account_key_queue,accountkey_array,account_key_cnt);
  if(NRF_SUCCESS != err_code)
  {
     NRF_LOG_ERROR("nrf_queue_read err %x\n",err_code);
  }
  for (size_t i=0;i< account_key_cnt ;i++)
  {
     err_code = nrf_queue_push(&account_key_queue,(accountkey_array+i));
     if(NRF_SUCCESS != err_code)
      {
        NRF_LOG_ERROR("nrf_queue_push err %x\n",err_code);
      }
  }
  for (size_t i = 0; i < account_key_cnt; i++) {
     nrf_crypto_hmac_context_t m_context;

        // Initialize frontend (which also initializes backend).
    err_code = nrf_crypto_hmac_init(&m_context,
                                    &g_nrf_crypto_hmac_sha256_info,
                                    accountkey_array[i].account_key,
                                    FP_ACCOUNT_KEY_LEN);
    if(NRF_SUCCESS != err_code)
      {
        NRF_LOG_ERROR("nrf_crypto_hmac_init err %x\n",err_code);
      }
    

    // Push all data in one go (could be done repeatedly)
    err_code = nrf_crypto_hmac_update(&m_context, auth_data_buf, auth_data_buf_len);
    if(NRF_SUCCESS != err_code)
      {
        NRF_LOG_ERROR("nrf_crypto_hmac_update err %x\n",err_code);
      }

    // Finish calculation
    err_code = nrf_crypto_hmac_finalize(&m_context, local_auth_seg, &local_auth_seg_len);
     if(NRF_SUCCESS != err_code)
      {
        NRF_LOG_ERROR("nrf_crypto_hmac_finalize err %x\n",err_code);
      }
   
   if(!memcmp(local_auth_seg, Pauth_seg, FP_FMDN_AUTH_SEG_LEN))
   {
      return true;
   }
  }
  return false;
}
static int beacon_parameters_read_handle(uint8_t *data,uint16_t len)
{
    uint8_t auth_seg[FP_FMDN_AUTH_SEG_LEN];
    uint8_t auth_data_buf[100];
    size_t auth_data_buf_len = 0;
    static const uint8_t req_data_len = BEACON_PARAMETERS_REQ_PAYLOAD_LEN;
  static const uint8_t rsp_data_len = BEACON_PARAMETERS_RSP_PAYLOAD_LEN;
    struct fp_fmdn_auth_data auth_data;
    memcpy(auth_seg,data+2,FP_FMDN_AUTH_SEG_LEN);

    memset(&auth_data, 0, sizeof(auth_data));
    auth_data.Prandom_nonce = &random_nonce;
    auth_data.data_id = BEACON_ACTIONS_BEACON_PARAMETERS_READ;
    auth_data.data_len = req_data_len;

    auth_data_encode(auth_data_buf,&auth_data,&auth_data_buf_len);

    account_key_find_iterator(auth_data_buf,auth_data_buf_len,auth_seg);




}
